"""
Ուսանողներից մեկը մեր ուշադրությունը բերեց հետևյալ խնդրին.
Գտնել Ֆիբոնաչիի հաջորդականության երեք թիվ, որոնց միջինը
հավասար է 658, այսինքն (a + b + c) / 3 = 658, որտեղ
a-ն, b-ն և c-ն Ֆիբոնաչիի հաջորդականությունում իրար հետևից
գտնվող թվեր են:

Խնդիրը լուծել եմ կոնկրետ 658 թվի համար։ Հնարավոր է նաև
ստեղծել ֆունկցիա, որը կգտնի a, b, c-ն ցանկացած մուտքագրվող թվի համար։
Նույնիսկ Ֆիբոնաչիի հաջորդականությունից ցանկացած քանակությամբ թվերի համար։
"""

a = 1
b = 1
c = 2

c_final = 658 * 3 / 2

found = False

while c < c_final:
    a, b, c = b, c, b + c
    if c == c_final:
        found = True

if found:
    print(f'a = {a}\nb = {b}\nc = {c}')
else:
    print('No matches')

"""
The Answer
a = 377
b = 610
c = 987
"""
